[
  {
    "id": "1",
    "yearRead": "2018",
    "isbn": "978-0345816023",
    "author": "Jordan Peterson",
    "amazonUrl": "https://a.co/d/8CGwooV",
    "title": "12 Rules for Life: An Antidote to Chaos",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/412z30W2N-L._SX330_BO1,204,203,200_.jpg",
    "description": "What does everyone in the modern world need to know? Renowned psychologist Jordan B. Peterson's answer to this most difficult of questions uniquely combines the hard-won truths of ancient tradition with the stunning revelations of cutting-edge scientific research. Humorous, surprising and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street. What does the nervous system of the lowly lobster have to tell us about standing up straight (with our shoulders back) and about success in life? Why did ancient Egyptians worship the capacity to pay careful attention as the highest of gods? What dreadful paths do people tread when they become resentful, arrogant and vengeful? Dr. Peterson journeys broadly, discussing discipline, freedom, adventure and responsibility, distilling the world's wisdom into 12 practical and profound rules for life. 12 Rules for Life shatters the modern commonplaces of science, faith and human nature, while transforming and ennobling the mind and spirit of its readers."
  },
  {
    "id": "2",
    "yearRead": "2018",
    "isbn": "978-1608467730",
    "author": "Alfred W. McCoy",
    "amazonUrl": "https://a.co/d/fmdXPdq",
    "title": "In the Shadows of the American Century: The Rise and Decline of US Global Power",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/41pYQvu9bFL._SX331_BO1,204,203,200_.jpg",
    "description": "In a completely original analysis, prize-winning historian Alfred W. McCoy explores America’s rise as a world power—from the 1890s through the Cold War—and its bid to extend its hegemony deep into the twenty-first century through a fusion of cyberwar, space warfare, trade pacts, and military alliances. McCoy then analyzes the marquee instruments of US hegemony—covert intervention, client elites, psychological torture, and worldwide surveillance. Peeling back layers of secrecy, McCoy exposes a military and economic battle for global domination fought in the shadows, largely unknown to those outside the highest rungs of power. Can the United States extend the “American Century” or will China guide the globe for the next hundred years? McCoy devotes his final chapter to these questions, boldly laying out a series of scenarios that could lead to the end of Washington’s world domination by 2030."
  },
  {
    "id": "3",
    "yearRead": "2018",
    "isbn": "978-0062303028",
    "author": "Christopher R. Browning",
    "amazonUrl": "https://a.co/d/7rvidrD",
    "title": "Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/51LEkLnM3RL._SX330_BO1,204,203,200_.jpg",
    "description": "Christopher R. Browning’s shocking account of how a unit of average middle-aged Germans became the cold-blooded murderers of tens of thousands of Jews—now with a new afterword and additional photographs. Ordinary Men is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever. While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  "
  },
  {
    "id": "4",
    "yearRead": "2018",
    "isbn": "978-1717881540",
    "author": "John Stuart Mill",
    "amazonUrl": "https://a.co/d/8mqT3Bj",
    "title": "On Liberty",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/31x1mgxjA9L._SX311_BO1,204,203,200_.jpg",
    "description": "'A person may cause evil to others not only by his actions but by his inaction, and in either case he is justly accountable to them for the injury.' ― John Stuart Mill, On Liberty"
  },
  {
    "id": "5",
    "yearRead": "2018",
    "isbn": "978-0451524935",
    "author": "George Orwell",
    "amazonUrl": "https://a.co/d/gvrKYjL",
    "title": "1984",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/31lWUHDG7uL._SX282_BO1,204,203,200_.jpg",
    "description": "Written in 1948, 1984 was George Orwell’s chilling prophecy about the future. And while 1984 has come and gone, his dystopian vision of a government that will do anything to control the narrative is timelier than ever...  •Nominated as one of America’s best-loved novels by PBS’s The Great American Read•  'The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.'  Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can’t escape the fact that Big Brother is always watching... A startling and haunting vision of the world, 1984 is so powerful that it is completely convincing from start to finish. No one can deny the influence of this novel, its hold on the imaginations of multiple generations of readers, or the resiliency of its admonitions—a legacy that seems only to grow with the passage of time."
  },
  {
    "id": "6",
    "yearRead": "2018",
    "isbn": "978-0140449280",
    "author": "Plato",
    "amazonUrl": "https://a.co/d/022Rvvy",
    "title": "The Last Days of Socrates",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/518Vb776nNL._SX323_BO1,204,203,200_.jpg",
    "description": "The trial and death of Socrates (469-399 BCE) have almost as central a place in Western consciousness as the trial and death of Jesus. In four superb dialogues, Plato provides the classic account. Euthyphro finds Socrates outside the court-house, debating the nature of piety, while the Apology is his robust rebuttal of the charges of impiety and a defence of the philosopher's life. In the Crito, while awaiting execution in prison, Socrates counters the arguments of friends urging him to escape. Finally, in the Phaedo, he is shown calmly confident in the face of death, skilfully arguing the case for the immortality of the soul.  For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."
  },
  {
    "id": "7",
    "yearRead": "2018",
    "isbn": "978-0486454115",
    "author": "Fyodor Dostoyevsky",
    "amazonUrl": "https://read.amazon.com/kp/embed?asin=B075CR4G91&preview=newtab&linkCode=kpe&ref_=cm_sw_r_kb_dp_fWejCbVN0TJSQ",
    "title": "Crime and Punishment",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/51zZH9paouL._SX310_BO1,204,203,200_.jpg",
    "description": "The two years before he wrote Crime and Punishment (1866) had been bad ones for Dostoyevsky. His wife and brother had died; the magazine he and his brother had started, Epoch, collapsed under its load of debt; and he was threatened with debtor's prison. With an advance that he managed to wangle for an unwritten novel, he fled to Wiesbaden, hoping to win enough at the roulette table to get himself out of debt. Instead, he lost all his money; he had to pawn his clothes and beg friends for loans to pay his hotel bill and get back to Russia. One of his begging letters went to a magazine editor, asking for an advance on yet another unwritten novel — which he described as Crime and Punishment. One of the supreme masterpieces of world literature, Crime and Punishment catapulted Dostoyevsky to the forefront of Russian writers and into the ranks of the world's greatest novelists. Drawing upon experiences from his own prison days, the author recounts in feverish, compelling tones the story of Raskolnikov, an impoverished student tormented by his own nihilism, and the struggle between good and evil. Believing that he is above the law, and convinced that humanitarian ends justify vile means, he brutally murders an old woman — a pawnbroker whom he regards as 'stupid, ailing, greedy…good for nothing.' Overwhelmed afterwards by feelings of guilt and terror, Raskolnikov confesses to the crime and goes to prison. There he realizes that happiness and redemption can only be achieved through suffering. Infused with forceful religious, social, and philosophical elements, the novel was an immediate success. This extraordinary, unforgettable work is reprinted here in the authoritative Constance Garnett translation."
  },
  {
    "id": "8",
    "yearRead": "2019",
    "isbn": "978-0765365279",
    "author": "Brandon Sanderson",
    "amazonUrl": "https://read.amazon.com/kp/embed?asin=B003P2WO5E&preview=newtab&linkCode=kpe&ref_=cm_sw_r_kb_dp_mpGsCbNHDXY2Q",
    "title": "The Way of Kings",
    "imageUrl": "https://images-na.ssl-images-amazon.com/images/I/516LVWmpRbL._SX303_BO1,204,203,200_.jpg",
    "description": "From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion. Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter. It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them. One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable. Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.  Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.  The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making. Speak again the ancient oaths:"
  }
]
